Autodesk.Revit.UI.UIView.GetZoomCorners
Gets the corners of the view's rectangle.
Since: 2013
Returns: The two points that define the corners of the view's rectangle in model coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The view is not a graphical view.

Autodesk.Revit.UI.UIView.ZoomAndCenterRectangle(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Zoom and center the view to a specified rectangle.
Since: 2013
viewCorner1: A corner of the desired view rectangle in model coordinates.
viewCorner2: The opposite corner of the desired view rectangle in model coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentException: The view corner points must differ when projected onto a plane perpendicular to the view direction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The view is not a graphical view.

Autodesk.Revit.UI.UIView.ZoomSheetSize
Zoom to the sheet size.
Since: 2014
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The view is not a graphical view.

Autodesk.Revit.UI.UIView.Zoom(System.Double)
Zoom the view.
Since: 2014
zoomFactor: Factor by which to zoom in or out. Values greater than 1 zooms in, less than 1 zooms out.
Throws Autodesk.Revit.Exceptions.ArgumentException: zoomFactor is not positive.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The view is not a graphical view.

Autodesk.Revit.UI.UIView.ZoomToFit
Zoom the view to fit its contents.
Since: 2014
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The view is not a graphical view.

Autodesk.Revit.UI.UIView.Close
Closes the view.
Since: 2014
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Cannot close a project's only open view.

Autodesk.Revit.UI.UIView.GetWindowRectangle
Gets the rectangle containing the coordinates of the view's drawing area.
Since: 2013
Remarks: The rectangle does not include the window border or title bar.
Returns: The rectangle of the view window.

Autodesk.Revit.UI.UIView.ViewId
The id of the View associated with a UIView.
Since: 2013
Returns: The id of the View.

Autodesk.Revit.UI.UIView
A class containing data about view windows in the Revit user interface.
Since: 2013